tutti-industries/tutti-controller-kit/MARK1/common/firmware/vendor/ch32v003fun/extralibs/fsusb.c
	// Force module to reset.
	USBFS->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
	USBFS->BASE_CTRL = 0x00;
	Delay_Us(10);

	// Enter device mode.
	USBFS->INT_EN    = USBFS_UIE_SUSPEND | USBFS_UIE_TRANSFER | USBFS_UIE_BUS_RST;
	USBFS->DEV_ADDR  = 0x00;
	USBFS->BASE_CTRL = USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN | USBFS_UC_DEV_PU_EN;
	USBFS->INT_FG    = 0xff;
	USBFS_InternalFinishSetup();
	USBFS->UDEV_CTRL = USBFS_UD_PD_DIS | USBFS_UD_PORT_EN;

	NVIC_EnableIRQ( USB_IRQn );

#if defined (CH32V30x)
	USBFS->OTG_CR = 0; //Note says only valid on 305, 307. 
#endif

// #ifndef CH32X03x
// 	// Actually go on-bus.
// 	USBFS->BASE_CTRL |= USBFS_UC_DEV_PU_EN;
// #endif

#if FUSB_IO_PROFILE
	funPinMode( DEBUG_PIN, GPIO_CFGLR_OUT_50Mhz_PP );
#endif

	// Go on-bus.
	return 0;
}

#ifdef CH5xx
void USBFSReset()
{
	NVIC_DisableIRQ( USB_IRQn );
#if defined (CH570_CH572)
	R16_PIN_ALTERNATE &= ~(RB_PIN_USB_EN | RB_UDP_PU_EN);
#elif defined (CH584_CH585)
	R16_PIN_CONFIG &= ~(RB_PIN_USB_EN | RB_UDP_PU_EN);
#else
	R16_PIN_ANALOG_IE &= ~(RB_PIN_USB_IE | RB_PIN_USB_DP_PU);
#endif
	USBFS->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
	USBFS->BASE_CTRL = 0x00;
	Delay_Us(10);
}
#endif

static inline uint8_t * USBFS_GetEPBufferIfAvailable( int endp )
{
	if( USBFSCTX.USBFS_Endp_Busy[ endp ] ) return 0;
	return USBFSCTX.ENDPOINTS[ endp ];
}

static inline int USBFS_SendEndpoint( int endp, int len )
{
	if( USBFSCTX.USBFS_errata_dont_send_endpoint_in_window || USBFSCTX.USBFS_Endp_Busy[ endp ] ) return -1;
	// This prevents sending while ep0 is receiving
	if( USBFSCTX.USBFS_SetupReqLen > 0 ) return -2;
#if defined (CH5xx) || defined (CH32X03x)
	// Check RB_UIS_SETUP_ACT
	if( (USBFS->INT_ST & 0x80) ) return -3;
#endif
	NVIC_DisableIRQ( USB_IRQn );
	UEP_CTRL_LEN( endp ) = len;
	UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_ACK;
	USBFSCTX.USBFS_Endp_Busy[ endp ] = 1;
	NVIC_EnableIRQ( USB_IRQn );
	return 0;
}

int USBFS_SendEndpointNEW( int endp, uint8_t* data, int len, int copy)
{
	if( USBFSCTX.USBFS_errata_dont_send_endpoint_in_window || USBFSCTX.USBFS_Endp_Busy[ endp ] ) return -1;
	// This prevents sending while ep0 is receiving
	if( USBFSCTX.USBFS_SetupReqLen > 0 ) return USBFSCTX.USBFS_SetupReqLen;
#if defined (CH5xx) || defined (CH32X03x)
	// Check RB_UIS_SETUP_ACT
	if( (USBFS->INT_ST & 0x80) ) return -3;
#endif
	if ( len )
	{
		if( copy )
		{
#if defined(CH5xx) || defined(CH32X03x)
			if ( endp != 4 ) UEP_DMA( endp ) = (uintptr_t)USBFSCTX.ENDPOINTS[endp];
#else
			UEP_DMA( endp ) = (uintptr_t)USBFSCTX.ENDPOINTS[endp];
#endif
			copyBuffer( USBFSCTX.ENDPOINTS[endp], data, len );
			copyBufferComplete();
		}
		else 
		{
#if defined(CH5xx) || defined(CH32X03x)
			if ( endp != 4 ) UEP_DMA( endp ) = (uintptr_t)data;
#else
			UEP_DMA( endp ) = (uintptr_t)data;
#endif
		}
	}
	// NVIC_DisableIRQ( USB_IRQn );
	UEP_CTRL_LEN( endp ) = len;
	UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_ACK;
	USBFSCTX.USBFS_Endp_Busy[ endp ] = 1;
	// NVIC_EnableIRQ( USB_IRQn );
	return 0;
}

static inline int USBFS_SendACK( int endp, int tx )
{
	if( tx ) UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_ACK;
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
	else UEP_CTRL_TX(endp) = ( UEP_CTRL_TX(endp) & ~USBFS_UEP_R_RES_MASK ) | USBFS_UEP_R_RES_ACK;
#else
	else UEP_CTRL_RX(endp) = ( UEP_CTRL_RX(endp) & ~USBFS_UEP_R_RES_MASK ) | USBFS_UEP_R_RES_ACK;
#endif
	return 0;
}

static inline int USBFS_SendNAK( int endp, int tx )
{
	if( tx ) UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_NAK;
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
	else UEP_CTRL_TX(endp) = ( UEP_CTRL_TX(endp) & ~USBFS_UEP_R_RES_MASK ) | USBFS_UEP_R_RES_NAK;
#else
	else UEP_CTRL_RX(endp) = ( UEP_CTRL_RX(endp) & ~USBFS_UEP_R_RES_MASK ) | USBFS_UEP_R_RES_NAK;
#endif
	return 0;
}

#if defined( FUNCONF_USE_USBPRINTF ) && FUNCONF_USE_USBPRINTF
int HandleInRequest( struct _USBState *ctx, int endp, uint8_t *data, int len )
{
	return 0;
}

static uint8_t usb_inputbuffer[USBFS_PACKET_SIZE]; // this can be extended if polling rate is low
static int usb_inbuf_idx;
void HandleDataOut( struct _USBState *ctx, int endp, uint8_t *data, int len )
{
	if ( endp == 0 )
	{
		ctx->USBFS_SetupReqLen = 0; // To ACK
	}
	else if( endp == 2 )
	{
		// discard oldest if polling is too slow
		int headroom = (sizeof(usb_inputbuffer) - usb_inbuf_idx) - len;
		if(headroom < 0) {
			// not enough space left, free up some
			int offset = -headroom;
			for(int i = offset; i < sizeof(usb_inputbuffer); i++) {
				usb_inputbuffer[i -offset] = usb_inputbuffer[i];
			}
			usb_inbuf_idx -= offset;
		}

		for(int i = 0; i < len; i++) {
			usb_inputbuffer[usb_inbuf_idx++] = data[i];
		}
	}
}

void handle_usbfs_input( int numbytes, uint8_t * data );
void poll_input() {
	if(usb_inbuf_idx) {
		handle_usbfs_input(usb_inbuf_idx, usb_inputbuffer);
		usb_inbuf_idx = 0;
	}
}

int HandleSetupCustom( struct _USBState *ctx, int setup_code )
{
	int ret = -1;
	if ( ctx->USBFS_SetupReqType & USB_REQ_TYP_CLASS )
	{
		switch ( setup_code )
		{
			case CDC_SET_LINE_CODING:
			case CDC_SET_LINE_CTLSTE:
			case CDC_SEND_BREAK: ret = ( ctx->USBFS_SetupReqLen ) ? ctx->USBFS_SetupReqLen : -1; break;
			case CDC_GET_LINE_CODING: ret = ctx->USBFS_SetupReqLen; break;
			default: ret = 0; break;
		}
	}
	else
	{
		ret = 0; // Go to STALL
	}
	return ret;
}
#endif // FUNCONF_USE_USBPRINTF

